       FD  ARCHIVO-CARGOS.
           01 CAR-DATOS.
              03 CAR-CODIGO      PIC 9(3).
              03 CAR-DESCRIPCION PIC X(40).
              03 CAR-ESTADO      PIC X(1).
