       FD  ARCHIVO-OFICINAS.
           01 OFI-DATOS.
              03 OFI-CLAVE.
                05 OFI-COD-EMPRESA        PIC 9(3).
                05 OFI-COD-OFICINA        PIC 9(3).
              03 OFI-NOMBRE               PIC X(30).
              03 OFI-ESTADO               PIC X(1).
              03 OFI-NOMBRE-GERENTE       PIC X(30).
              03 OFI-TEL-CONVENCIONAL     PIC 9(10).
              03 OFI-DIRECCION            PIC X(40).
