       FD  ARCHIVO-EMPRESAS.
           01 CIA-DATOS.
              03 CIA-CODIGO            PIC 9(3).
              03 CIA-DESCRIPCION       PIC X(30).
              03 CIA-ESTADO            PIC X(1).
              03 CIA-REPRE-LEGAL       PIC X(30).
              03 CIA-RUC               PIC 9(13).
              03 CIA-DIRECCION         PIC X(40).
              03 CIA-TELE-CONVENCIONAL PIC 9(10).
