       FD  ARCHIVO-PROFESIONES.
           01 PRO-DATOS.
              03 PRO-CODIGO      PIC 9(3).
              03 PRO-DESCRIPCION PIC X(30).
              03 PRO-ESTADO      PIC X(1).
